socialNetwork/wrk2/test-run/COMMAND_1/2
Running 1m test @ http://localhost:31111/wrk2-api/home-timeline/read
  8 threads and 16 connections
  Thread calibration: mean lat.: 1.382ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.025ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.035ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.953ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.997ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.104ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.920ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.11ms  414.47us   2.61ms   82.25%
    Req/Sec     1.06     14.55     0.00     99.45%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.98ms
 75.000%    1.25ms
 90.000%    1.57ms
 99.000%    2.61ms
 99.900%    3.17ms
 99.990%    3.17ms
 99.999%    3.17ms
100.000%    3.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.524     0.000000            1         1.00
       0.727     0.100000           40         1.11
       0.795     0.200000           80         1.25
       0.874     0.300000          120         1.43
       0.937     0.400000          160         1.67
       0.984     0.500000          200         2.00
       1.049     0.550000          220         2.22
       1.112     0.600000          240         2.50
       1.181     0.650000          260         2.86
       1.213     0.700000          280         3.33
       1.254     0.750000          300         4.00
       1.282     0.775000          310         4.44
       1.322     0.800000          321         5.00
       1.371     0.825000          330         5.71
       1.415     0.850000          340         6.67
       1.469     0.875000          350         8.00
       1.515     0.887500          355         8.89
       1.565     0.900000          360        10.00
       1.600     0.912500          365        11.43
       1.707     0.925000          370        13.33
       1.775     0.937500          375        16.00
       1.887     0.943750          378        17.78
       1.968     0.950000          380        20.00
       2.065     0.956250          383        22.86
       2.115     0.962500          385        26.67
       2.313     0.968750          388        32.00
       2.331     0.971875          389        35.56
       2.397     0.975000          390        40.00
       2.407     0.978125          392        45.71
       2.445     0.981250          393        53.33
       2.469     0.984375          394        64.00
       2.525     0.985938          395        71.11
       2.525     0.987500          395        80.00
       2.609     0.989062          396        91.43
       2.667     0.990625          397       106.67
       2.667     0.992188          397       128.00
       2.773     0.992969          398       142.22
       2.773     0.993750          398       160.00
       2.773     0.994531          398       182.86
       3.091     0.995313          399       213.33
       3.091     0.996094          399       256.00
       3.091     0.996484          399       284.44
       3.091     0.996875          399       320.00
       3.091     0.997266          399       365.71
       3.175     0.997656          400       426.67
       3.175     1.000000          400          inf
#[Mean    =        1.109, StdDeviation   =        0.414]
#[Max     =        3.174, Total count    =          400]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  472 requests in 1.00m, 91.73KB read
  Socket errors: connect 0, read 0, write 0, timeout 49
Requests/sec:      7.87
Transfer/sec:      1.53KB